УТ_для_edt.ДоставкаДеловыеЛинии/src/DataProcessors/ДЛ_Мультизаявка/ДЛ_Мультизаявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ДЛ_Мультизаявка</name>
</mdclass:DataProcessor>

УТ_для_edt.ДоставкаДеловыеЛинии/src/Catalogs/КонтактныеЛицаПартнеров/КонтактныеЛицаПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="877a04b6-4c0b-4715-b826-6ac77909e040">
  <name>КонтактныеЛицаПартнеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="65059fcf-d30d-4366-aabc-1736a2a1198c">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="89012594-b147-4b78-877f-5aab7931b40e">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d228be44-cb90-454d-a57c-16fc89dd78ba">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b63093be-8b18-45db-919f-2d2f35cdb506">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.ДоставкаДеловыеЛинии/src/DataProcessors/ДЛ_Мультизаявка/Forms/ВводКонтактныхЛиц/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого КонтактноеЛицо Из Параметры.КонтактныеЛица Цикл
		
		НовоеКонтактноеЛицо = КонтактныеЛица.Добавить(); 
		НовоеКонтактноеЛицо.ФИО = КонтактноеЛицо;	
		
	КонецЦикла;
	
	КонтрагентСсылка = Параметры.КонтрагентСсылка;	
	
КонецПроцедуры

&НаКлиенте
Процедура Завершить(Команда)
	
	СтрокаКонтактныеЛица = ""; 
	
	Для Каждого КонтактноеЛицо Из КонтактныеЛица Цикл
		
		Если ЗначениеЗаполнено(КонтактноеЛицо.ФИО) Тогда			
			
			СтрокаКонтактныеЛица = ?(СтрокаКонтактныеЛица = "", КонтактноеЛицо.ФИО, СтрокаКонтактныеЛица + "; " + КонтактноеЛицо.ФИО);			
						
		КонецЕсли;
		
	КонецЦикла;
	
	ОповеститьОВыборе(СтрокаКонтактныеЛица);	
	
КонецПроцедуры   

&НаКлиенте
Процедура ТелефоныФИОНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(КонтрагентСсылка) Тогда   
		
		ОО = Новый ОписаниеОповещения("ВыборКонтактноеЛицоЗавершение", ЭтаФорма);
		
		ТипКонтрагента = ТипЗнч(КонтрагентСсылка); 
		
		ПараметрыОткрытия = Новый Структура;			
		ПараметрыОткрытия.Вставить("РежимВыбора", Истина); 
		
		Если ТипКонтрагента = Тип("СправочникСсылка.Контрагенты") Тогда		 
			
			ПараметрыОтбора = Новый Структура("Владелец", ДЛ_ДеловыеЛинии.ПолучитьЗначениеРеквизита(КонтрагентСсылка, "Партнер"));
			
			ПараметрыОткрытия.Вставить("Отбор", ПараметрыОтбора);
			
			ОткрытьФорму("Справочник.КонтактныеЛицаПартнеров.ФормаВыбора", ПараметрыОткрытия,	ЭтаФорма,,,, ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		ИначеЕсли ТипКонтрагента = Тип("СправочникСсылка.Организации") Тогда 				
			
			ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыОткрытия,	ЭтаФорма,,,, ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ВыборКонтактноеЛицоЗавершение(Результат, ИмяРеквизита) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Если ТипЗнч(Результат) = Тип("ЭлементСпискаЗначений") Тогда
			
			Результат = Результат.Значение;	
			
		КонецЕсли;	
		
		Элементы.КонтактныеЛица.ТекущиеДанные.ФИО = СокрЛП(Результат);				 
		
	КонецЕсли;
	
КонецПроцедуры
